---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.Current
source: html/5c1cb742-5936-bba2-85df-dfa09bbcd372.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.Current Property

The current of the analytical equipment load.

## Syntax (C#)
```csharp
public double Current { get; }
```